Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# AboutIf
source: Checks if any one of the specified conditions are met and returns the corresponding value. If none of the conditions are met, the function returns the specified default value.
bg_bg: Проверява дали което и да е от указаните условия е изпълнено и връща съответната стойност. Ако нито едно от условията не е изпълнено, функцията връща указаната стойност по подразбиране.
ca_es: Comprova si una de les condicions especificades es compleix i retorna el valor corresponent. Si no es compleix cap condició, la funció retorna el valor per defecte especificat.
cs_cz: Zkontroluje, jestli je splněná některá ze zadaných podmínek, a vrátí odpovídající hodnotu. Pokud není splněná žádná podmínka, vrátí tato funkce zadanou výchozí hodnotu.
da_dk: Tjekker, om nogen af de angivne betingelser bliver opfyldt og returnerer de tilsvarende værdier. Hvis ingen af betingelserne bliver opfyldt, returnerer funktionen den angivne standardværdi.
de_de: Überprüft, ob eine der angegebenen Bedingungen erfüllt ist und gibt den entsprechenden Wert zurück. Wenn keine der Bedingungen erfüllt ist, gibt die Funktion den angegebenen Standardwert zurück.
el_gr: Ελέγχει εάν κάποια από τις καθορισμένες συνθήκες ικανοποιείται και επιστρέφει την αντίστοιχη τιμή. Αν δεν ικανοποιείται καμία συνθήκη, η συνάρτηση επιστρέφει την καθορισμένη προεπιλεγμένη τιμή.
es_es: Comprueba si se cumple alguna de las condiciones especificadas y devuelve el valor correspondiente. Si no se cumple ninguna de las condiciones, la función devuelve el valor predeterminado especificado.
et_ee: Kontrollib, kas mõni määratud tingimustest on täidetud ja tagastab vastava väärtuse. Kui ükski tingimus pole täidetud, tagastab funktsioon määratud vaikeväärtuse.
eu_es: Zehaztutako baldintzaren bat betetzen den egiaztatzen du eta dagokion balioa itzultzen du. Ez bada baldintzarik betetzen, funtzioak balio lehenetsia itzuliko du.
fi_fi: Tarkistaa, täyttyykö jokin määritetyistä ehdoista, ja palauttaa vastaavan arvon. Jos mikään ehdoista ei täyty, funktio palauttaa määritetyn oletusarvon.
fr_fr: Vérifie si l’une des conditions spécifiées est remplie, puis retourne la valeur correspondante. Si aucune condition n’est remplie, la fonction retourne la valeur par défaut spécifiée.
gl_es: Comproba se se cumpre algunha das condicións especificadas e devolve o valor correspondente. Se non se cumpre ningunha das condicións, a función devolve o valor predefinido especificado.
hi_in: जाँचता है कि क्या निर्दिष्ट शर्तों में से किसी एक की पूर्ति हो रही है और संबंधित मान लौटाता है. यदि किसी भी शर्त की पूर्ति नहीं होती, तो फ़ंक्शन से निर्दिष्ट डिफ़ॉल्ट मान लौटता है.
hr_hr: Provjerava jesu li zadovoljeni neki od navedenih uvjeta i vraća odgovarajuću vrijednost. Ako nijedan od uvjeta nije ispunjen, funkcija vraća navedenu zadanu vrijednost.
hu_hu: Ellenőrzi, hogy teljesül-e bármelyik megadott feltétel, és a megfelelő értéket adja vissza. Ha egyik feltétel sem teljesül, akkor a függvény a megadott alapértelmezett értéket adja vissza.
it_it: Verifica se è stata soddisfatta una o più delle condizioni specificate e restituisce il valore corrispondente. Se non è stata soddisfatta alcuna condizione, la funzione restituisce il valore predefinito specificato.
ja_jp: 指定された条件のいずれかを満たすかどうかチェックし、対応する値を返します。条件をいずれも満たさない場合には、この関数は指定の既定値を返します。
kk_kz: Көрсетілген шарттардың кез келген біреуінің орындалуын не орындалмауын тексереді және сәйкес мәнді қайтарады. Егер шарттардың ешқайсысы орындалмаса, функция көрсетілген әдепкі мәнді қайтарады.
ko_kr: 지정된 조건 중 하나가 충족되는지 확인하고 해당 값을 반환합니다. 조건이 충족하지 않으면 함수가 지정된 기본값을 반환합니다.
lt_lt: Tikrina, ar vykdoma kuri nors iš nurodytų sąlygų, ir pateikia atitinkamą reikšmę. Jei nė viena iš sąlygų nevykdoma, funkcija pateikia nurodytą numatytąją reikšmę.
lv_lv: Pārbauda, vai kāds no norādītajiem nosacījumiem ir izpildīts, un atgriež atbilstošo vērtību. Ja neviens nosacījums nav izpildīts, funkcija atgriež norādīto noklusējuma vērtību.
ms_my: Menyemak jika salah satu daripada syarat yang ditentukan dipenuhi dan mengembalikan nilai yang sepadan. Jika tiada syarat dipenuhi, fungsi mengembalikan nilai lalai yang ditentukan.
nb_no: Kontrollerer om noen av de angitte betingelsene er oppfylt, og returnerer den tilsvarende verdien. Hvis ingen av betingelsene er oppfylt, returnerer funksjonen den angitte standardverdien.
nl_nl: Hiermee wordt gecontroleerd of aan een van de opgegeven voorwaarden wordt voldaan en wordt de bijbehorende waarde geretourneerd. Als aan geen van de voorwaarden wordt voldaan, retourneert de functie de opgegeven standaardwaarde.
pl_pl: Sprawdza, czy którykolwiek z określonych warunków jest spełniony, i zwraca odpowiednią wartość. Jeśli żaden z warunków nie jest spełniony, funkcja zwraca określoną wartość domyślną.
pt_br: Verifica se alguma das condições especificadas foi atendida e retorna o valor correspondente. Se nenhuma das condições for atendida, a função retornará o valor padrão especificado.
pt_pt: Verifica se algumas das condições especificadas são cumpridas e devolve o valor correspondente. Se nenhuma das condições forem cumpridas, a função devolve o valor predefinido especificado.
ro_ro: Verifică dacă vreuna dintre condițiile specificate este întrunită și returnează valoarea corespunzătoare. Dacă nu este întrunită nicio condiție, funcția returnează valoarea implicită specificată.
ru_ru: Проверяет, выполняется ли любое из заданных условий, и возвращает соответствующее значение. Если ни одно из условий не выполняется, функция возвращает указанное значение по умолчанию.
sk_sk: Skontroluje, či je splnená ktorákoľvek zo zadaných podmienok, a vráti zodpovedajúcu hodnotu. Ak nie je splnená žiadna podmienka, funkcia vráti zadanú predvolenú hodnotu.
sl_si: Preveri, ali je izpolnjen kateri izmed določenih pogojev in vrne ustrezno vrednost. Če ni izpolnjen noben izmed pogojev, funkcija vrne določeno privzeto vrednost.
sr_cyrl_rs: Проверава да ли било који од наведених услова испуњава и враћа одговарајућу вредност. Ако ниједан од услова није испуњен, функција враћа наведену подразумевану вредност.
sr_latn_rs: Proverava da li bilo koji od navedenih uslova ispunjava i vraća odgovarajuću vrednost. Ako nijedan od uslova nije ispunjen, funkcija vraća navedenu podrazumevanu vrednost.
sv_se: Kontrollerar om något av de angivna villkoren uppfyllts och returnerar det motsvarande värdet. Om inget av villkoren uppfyllts, returnerar funktionen det angivna standardvärdet.
th_th: ตรวจสอบว่าเป็นไปตามหนึ่งในเงื่อนไขทั้งหมดที่ระบุไว้และคืนค่าที่สอดคล้องกัน หากไม่เป็นไปตามเงื่อนไขใดๆ ฟังก์ชันจะคืนค่าเริ่มต้นที่ระบุไว้
tr_tr: Belirtilen koşullardan herhangi birinin karşılanıp karşılanmadığını denetler ve karşılık gelen değeri döndürür. Hiçbir koşul karşılanmadıysa işlev varsayılan değeri döndürür.
uk_ua: Перевіряє дані на відповідність визначеним умовам і повертає певне значення залежно від збігів. Якщо збігів немає, функція повертає вказане стандартне значення.
vi_vn: Kiểm tra xem có bất kỳ điều kiện được chỉ định nào được đáp ứng và trả về giá trị tương ứng hay không. Nếu không có điều kiện nào được đáp ứng thì hàm sẽ trả về giá trị mặc định được chỉ định.
zh_cn: 检查是否满足指定条件中的任何一个，并返回对应值。如果不满足任何条件，则函数返回指定默认值。
zh_tw: 檢查是否符合其中任一指定的條件，並傳回對應的值。如果未符合任何條件，則該函數會傳回指定的預設值。

# IfArgCond
source: logical_test
bg_bg: логически_тест
ca_es: prova_lògica
cs_cz: logický_test
da_dk: logisk_tekst
de_de: Wahrheitsprüfung
el_gr: λογική_έλεγχος
es_es: prueba_lógica
et_ee: loogikatest
eu_es: proba_logikoa
fi_fi: looginen_testi
fr_fr: test_logique
gl_es: proba_lóxica
hi_in: तार्किक_पाठ
hr_hr: logički_test
hu_hu: logikai_vizsgálat
it_it: testo_espressionelogica
ja_jp: 論理式
kk_kz: логикалық_тексеру
ko_kr: 논리_테스트
lt_lt: loginis_testas
lv_lv: loģiskais_tests
ms_my: ujian_logik
nb_no: logisk_test
nl_nl: logische_test
pl_pl: test_logiczny
pt_br: teste_lógico
pt_pt: teste_lógico
ro_ro: test_logic
ru_ru: логическое_выражение
sk_sk: logický_test
sl_si: logični_preizkus
sr_cyrl_rs: логички_тест
sr_latn_rs: logički_test
sv_se: logisk_test
th_th: ทดสอบ_ลอจิคัล
tr_tr: mantıksal_test
uk_ua: логічна_перевірка
vi_vn: kiểm_tra_lô_gic
zh_cn: 逻辑测试
zh_tw: 邏輯_測試

# IfArgTrueValue
source: true_value
bg_bg: стойност_вярно
ca_es: valor_verdader
cs_cz: hodnota_true
da_dk: sand_værdi
de_de: wahrWert
el_gr: τιμή_true
es_es: valor_verdadero
et_ee: tõene_väärtus
eu_es: true_balioa
fi_fi: true-arvo
fr_fr: valeur_true
gl_es: valor_verdadeiro
hi_in: सही_मान
hr_hr: istinita_vrijednost
hu_hu: true_érték
it_it: valore_vero
ja_jp: trueの場合の_値
kk_kz: шын_мән
lt_lt: reikšmė_teisinga
lv_lv: patiesa_vērtība
ms_my: nilai_benar
nb_no: sann_verdi
nl_nl: waarde_voor_waar
pl_pl: wartość_prawda
pt_pt: valor_verdadeiro
ro_ro: valoare_adevărat
ru_ru: значение_в_случае_истинности
sk_sk: hodnota_true
sl_si: vrednost_true
sr_cyrl_rs: тачна_вредност
sr_latn_rs: tačna_vrednost
sv_se: sant_värde
th_th: ค่า_จริง
tr_tr: true_değeri
uk_ua: значення_true
vi_vn: gia_tri_dung
zh_cn: true值
zh_tw: True_值

# IfArgElseValue
source: else_value
bg_bg: стойност_тогава
ca_es: altre_valor
cs_cz: hodnota_else
da_dk: eller_værdi
de_de: sonstWert
el_gr: τιμή_else
es_es: otro_valor
et_ee: muu_väärtus
eu_es: beste_bat_balioa
fi_fi: muuten_arvo
fr_fr: valeur_autre
gl_es: outro_valor
hi_in: अन्य_मान
hr_hr: druga_vrijednost
hu_hu: else_érték
it_it: valore_altrimenti
ja_jp: その他の場合の_値
kk_kz: кері_жағдайда_мәні
lt_lt: kita_reikšmė
lv_lv: cita_vērtība
ms_my: nilai_lain
nb_no: annen_verdi
nl_nl: waarde_voor_anders
pl_pl: wartość_w_przeciwnym_razie
pt_pt: valor_else
ro_ro: valoare_altfel
ru_ru: альтернативное_значение
sk_sk: hodnota_else
sl_si: vrednost_else
sr_cyrl_rs: друга_вредност
sr_latn_rs: druga_vrednost
sv_se: annars_värde
th_th: ค่า_อื่น
tr_tr: else_değeri
uk_ua: значення_else
vi_vn: gia_tri_khac
zh_cn: else值
zh_tw: 否則_值

# AboutIf_logical_test
source: A condition that results in a boolean value.
bg_bg: Условие, резултатът от което е булева стойност.
ca_es: Una condició que dóna com a resultat un valor booleà.
cs_cz: Podmínka, jejímž výsledkem je logická hodnota
da_dk: En betingelse, der resulterer i en boolesk værdi.
de_de: Eine Bedingung, die einen booleschen Wert ergibt.
el_gr: Μια συνθήκη που έχει ως αποτέλεσμα μια δυαδική τιμή.
es_es: Una condición cuyo resultado es un valor booleano.
et_ee: Tingimus, mille tulemuseks on loogikaväärtus.
eu_es: Emaitza gisa balio boolear bat izango duen baldintza.
fi_fi: Ehto, jonka tuloksena on totuusarvo.
fr_fr: Condition dont le résultat est une valeur booléenne.
gl_es: Condición que dá lugar a un valor booleano.
hi_in: ऐसी शर्त जिसका परिणाम कोई बूलियन मान हो.
hr_hr: Uvjet koji rezultira Booleanovom vrijednošću.
hu_hu: Egy logikai értéket eredményül adó feltétel.
it_it: Condizione che produce un valore booleano.
ja_jp: ブール値になる条件。
kk_kz: Логикалық мәнге әкелетін шарт.
ko_kr: 부울 값이 되는 조건입니다.
lt_lt: Sąlyga, kuri pateikia Bulio logikos reikšmę.
lv_lv: Nosacījums, kas nodrošina Būla vērtību.
ms_my: Syarat yang menghasilkan nilai boolean.
nb_no: En betingelse som resulterer i en boolsk verdi.
nl_nl: Een voorwaarde die resulteert in een booleaanse waarde.
pl_pl: Warunek, którego wynikiem jest wartość logiczna.
pt_br: Condição que resulta em um valor booleano.
pt_pt: Uma condição que resulta num valor booleano.
ro_ro: O condiție care are ca rezultat o valoare booleană.
ru_ru: Условие, которое возвращает логическое значение.
sk_sk: Podmienka, ktorej výsledkom je booleovská hodnota.
sl_si: Pogoj, katerega rezultat je logična vrednost.
sr_cyrl_rs: Услов који даје Булову вредност.
sr_latn_rs: Uslov koji daje Bulovu vrednost.
sv_se: Ett villkor som resulterar i ett booleskt värde.
th_th: เงื่อนไขที่ให้ผลลัพธ์เป็นค่าบูลีน
tr_tr: Boole değeri oluşturan bir koşul.
uk_ua: Умова, що викликає логічне значення.
vi_vn: Điều kiện dẫn đến giá trị boolean.
zh_cn: 生成布尔值的条件。
zh_tw: 產生布林值的條件。

# AboutIf_true_value
source: An expression that provides the result of If when the condition is true.
bg_bg: Израз, който предоставя резултат от If, когато условието е true.
ca_es: Una expressió que proporciona el resultat de l'operació If quan la condició és true.
cs_cz: Výraz, který poskytuje výsledek funkce If, pokud je podmínka pravdivá
da_dk: Et udtryk, der giver resultatet af If, når betingelsen er sand.
de_de: Ein Ausdruck, der das Ergebnis von If zurückgibt, wenn die Bedingung wahr ist.
el_gr: Μια παράσταση που παρέχει το αποτέλεσμα της συνθήκης If όταν η συνθήκη έχει τιμή true.
es_es: Una expresión que proporciona el resultado de If cuando la condición es TRUE.
et_ee: Avaldis, mis esitab funktsiooni If tulemuse, kui tingimus on tõene.
eu_es: Baldintza egia denean "If" funtzioaren emaitza ematen duen espresioa.
fi_fi: Lauseke, joka antaa If-kohteen tuloksen, kun määritetty ehto on tosi.
fr_fr: Expression qui fournit le résultat de la fonction If lorsque la condition est vraie.
gl_es: Expresión que fornece o resultado da operación If cando a condición é verdadeira.
hi_in: ऐसा व्यंजक जो तब परिणाम प्रदान करता है If जब शर्त सत्य हो.
hr_hr: Izraz koji daje rezultat funkcije If kada je uvjet true.
hu_hu: Egy kifejezés, amely arra az esetre adja meg az If eredményét, ha a feltétel igaz.
it_it: Espressione che fornisce il risultato di If quando la condizione è vera.
ja_jp: 条件が True の場合の If の結果を示す式。
kk_kz: Шарт "шын" мәніне ие болғанда "If" функциясының нәтижесін беретін өрнек.
ko_kr: 조건이 true일 경우 If의 결과를 제공하는 식입니다.
lt_lt: Reiškinys, kuris pateikia If sąlygos rezultatą, jei sąlygos reikšmė yra TRUE.
lv_lv: Izteiksme, kas nodrošina If rezultātu, ja nosacījums ir patiess.
ms_my: Ungkapan yang memberikan hasil Jika If apabila syarat adalah benar.
nb_no: Et uttrykk som gir resultatet If når betingelsen er oppfylt.
nl_nl: Een expressie waarmee het resultaat van If wordt opgegeven als aan de voorwaarde wordt voldaan.
pl_pl: Wyrażenie, które zwraca wynik funkcji If, jeśli warunek ma wartość prawda.
pt_br: Expressão que fornece o resultado de If quando a condição é verdadeira.
pt_pt: Uma expressão que fornece o resultado de If se a condição for verdadeira.
ro_ro: O expresie care furnizează rezultatul funcției If atunci când condiția este adevărată.
ru_ru: Выражение, которое определяет результат операции If, когда условие имеет значение true.
sk_sk: Výraz, ktorý poskytuje výsledok operácie If, keď je podmienka pravdivá.
sl_si: Izraz, ki zagotovi rezultat funkcije »If«, če je izpolnjen pogoj.
sr_cyrl_rs: Израз који пружа резултат If када је услов исправан.
sr_latn_rs: Izraz koji pruža rezultat If kada je uslov ispravan.
sv_se: Ett uttryck som ger resultatet för If när villkoret är sant.
th_th: นิพจน์ที่ให้ผลลัพธ์ของ If เมื่อเงื่อนไขที่ระบุไว้ทั้งหมดเป็น true
tr_tr: Koşul true olduğunda If işlevinin sonucunu sağlayan bir ifade.
uk_ua: Вираз, що надає результати операції If, якщо дані відповідають умовам.
vi_vn: Biểu thức cho kết quả If khi điều kiện là đúng.
zh_cn: 在条件为 true 时提供 If 的结果的表达式。
zh_tw: 此運算式提供當條件為 True 時，If 的結果。

# AboutIf_else_value
source: An expression that provides the result of If when all specified conditions are false.
bg_bg: Израз, който предоставя резултатът от If, когато всички указани условия са false.
ca_es: Expressió que proporciona el resultat de l'operació If quan totes les condicions especificades són false.
cs_cz: Výraz, který poskytuje výsledek funkce If, pokud jsou všechny zadané podmínky nepravdivé
da_dk: Et udtryk, der giver resultatet af If, når alle angivne betingelser er falske.
de_de: Ein Ausdruck, der das Ergebnis von If zurückgibt, wenn alle angegebenen Bedingungen falsch sind.
el_gr: Μια παράσταση που παρέχει το αποτέλεσμα της συνθήκης If όταν όλες οι καθορισμένες συνθήκες έχουν τιμή false.
es_es: Una expresión que proporciona el resultado de If cuando todas las condiciones especificadas son FALSE.
et_ee: Avaldis, mis esitab funktsiooni If tulemuse, kui kõik määratud tingimused on väärad.
eu_es: Zehaztutako baldintza guztiak faltsuak direnean "If" funtzioaren emaitza ematen duen espresioa.
fi_fi: Lauseke, joka antaa If-kohteen tuloksen, kun kaikki määritetyt ehdot ovat epätosia.
fr_fr: Expression qui fournit le résultat de la fonction If lorsque toutes les conditions spécifiées sont fausses.
gl_es: Expresión que fornece o resultado da operación If cando todas as condicións especificadas son falsas.
hi_in: ऐसा व्यंजक जो तब परिणाम प्रदान करता है If जब सभी निर्दिष्ट शर्तें असत्य हों.
hr_hr: Izraz koji daje rezultat funkcije If kada su svi navedeni uvjeti false.
hu_hu: Egy kifejezés, amely arra az esetre adja meg az If eredményét, ha minden megadott feltétel hamis.
it_it: Espressione che fornisce il risultato di If quando tutte le condizioni specificate sono false.
ja_jp: 指定された条件がすべて False の場合の If の結果を提供する式。
kk_kz: Барлық көрсетілген шарттар "жалған" мәніне ие болғанда "If" функциясының нәтижесін беретін өрнек.
ko_kr: 지정된 모든 조건이 false일 경우 If의 결과를 제공하는 식입니다.
lt_lt: Reiškinys, kuris pateikia If sąlygos rezultatą, jei visų nuorodų sąlygų reikšmė yra FALSE.
lv_lv: Izteiksme, kas nodrošina funkcijas If rezultātu, ja visi norādītie nosacījumi ir aplami.
ms_my: Ungkapan yang memberikan hasil Jika If apabila semua syarat yang ditentukan adalah palsu.
nb_no: Et uttrykk som gir resultatet If når ingen angitte betingelser er oppfylt.
nl_nl: Een expressie waarmee het resultaat van If wordt opgegeven als aan geen van de opgegeven voorwaarden wordt voldaan.
pl_pl: Wyrażenie, które zwraca wynik funkcji If, jeśli wszystkie określone warunki mają wartość fałsz.
pt_br: Expressão que fornece o resultado de If quando todas as condições especificadas forem falsas.
pt_pt: Uma expressão que fornece o resultado de If quando todas as condições especificadas forem falsas.
ro_ro: O expresie care furnizează rezultatul funcției If atunci când toate condițiile specificate sunt false.
ru_ru: Выражение, которое определяет результат операции If, когда все указанные условия имеют значение false.
sk_sk: Výraz, ktorý poskytuje výsledok operácie If, keď sú všetky zadané podmienky nepravdivé.
sl_si: Izraz, ki zagotovi rezultat funkcije »If«, če ni izpolnjen noben izmed pogojev.
sr_cyrl_rs: Израз који пружа резултат за If када су сви наведени услови неисправни.
sr_latn_rs: Izraz koji pruža rezultat za If kada su svi navedeni uslovi neispravni.
sv_se: Ett uttryck som ger resultatet för If när alla angivna villkor är falska.
th_th: นิพจน์ที่ให้ผลลัพธ์ของ If เมื่อเงื่อนไขที่ระบุไว้ทั้งหมดเป็น false
tr_tr: Belirtilen tüm koşullar false olduğunda If işlevinin sonucunu sağlayan bir ifade.
uk_ua: Вираз, що надає результат операції If, коли дані не відповідають жодній умові.
vi_vn: Biểu thức cho kết quả If khi tất cả các điều kiện được chỉ định đều sai.
zh_cn: 在所有指定条件都是 false 时提供 If 的结果的表达式。
zh_tw: 此運算式提供當所有指定的條件皆為 False 時，If 的結果。
